lyshgd148/STM32Pjo/9- PCA9685/User/main.c
#include "stm32f10x.h" // Device header
#include "Delay.h"
#include "OLED.h"
#include "OLED_Font.h"
#include "stdio.h"
#include "Serial.h"
#include <stdlib.h>
#include <string.h>
#include "PAC9685.h"
#include "math.h"



int main(void)
{
	Serial_Init();
    PAC9685_Init();
	PCA9685_SetAngle(0,30);
	Delay_ms(200);
	PCA9685_SetAngle(1,30);
	Delay_ms(200);
	PCA9685_SetAngle(2,30);
	Delay_ms(200);
	PCA9685_SetAngle(3,30);
	Delay_ms(200);

    while (1)
    {
		if (Serial_RxFlag == 1)
		{
			uint16_t angle;
			char *p = strchr(Serial_RxPacket, '=');
			if (p)
			{
				angle = (uint16_t)atoi(p + 1);
			}
			if(Serial_RxPacket[4]=='1'){
			PCA9685_SetAngle(0,angle);
			printf("Angle1_OK!\n");
			}
			else if(Serial_RxPacket[4]=='2'){
			PCA9685_SetAngle(1,angle);
			printf("Angle2_OK!\n");
			}
			else if(Serial_RxPacket[4]=='3'){
			PCA9685_SetAngle(2,angle);
			printf("Angle3_OK!\n");
			}
			else if(Serial_RxPacket[4]=='4'){
			PCA9685_SetAngle(3,angle);
			printf("Angle4_OK!\n");
			}

			Serial_RxFlag = 0;
		}
    }
}